pages/blog/17-Aug-2023.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-11 Sun 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>17 Aug 2023 - Image Maps</title>
<meta name="description" content="Fleshed out the image map part of the test page this week!" />
<meta name="generator" content="Org Mode" />
<link href="../../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">17 Aug 2023 - Image Maps</h1>
<p>
Not mentioned happened this week. More dissertation stuff with time in there somewhere for work and gaming. Oh! There was a little time to work on this site, update my emacs configuration for transparency, and flesh out a desktop environment revolving around QTile, LxQT, and Waylang. So I guess a <b>lot</b> happened this week! First this site!
</p>
<div id="outline-container-org5aef92b" class="outline-2">
<h2 id="org5aef92b">More information about image maps!</h2>
<div class="outline-text-2" id="text-org5aef92b">
<p>
I have fleshed out the information on image maps in the <a href="../test.htm">test page</a>. As I mentioned on that page, I didn&rsquo;t really use image maps much, but I saw them used quite a bit when I was browsing. Even companies would use them for navigation banners. Actually I&rsquo;d love to find an archive of a site that used it, but I&rsquo;ll leave that for another time. Right now I&rsquo;m using a site I used to use a lot to learn new HTML, don&rsquo;t worry it is linked in that page. Basically all I did was create a <i>slightly</i> more simple example and explain a few more things about the tags and how I remembered them being used in the old times. It works though for now. Hopefully I&rsquo;ll be able to think of other things to put on that page that actually demonstrate how I used to code, or how I saw other code back in the day. For now, enjoy what&rsquo;s there!
</p>
</div>
</div>
<div id="outline-container-orgb92c6ea" class="outline-2">
<h2 id="orgb92c6ea">Let&rsquo;s talk about Linux</h2>
<div class="outline-text-2" id="text-orgb92c6ea">
<p>
Because work and school is boring, we&rsquo;ll talk about Linux instead! I am just about finished with a custom desktop environment that uses QTitle as a Wayland compositor and a few utilities from LxQT, namely PCManFM-QT and LxQT-Archiver. The main star of the show, basically, is still Emacs. Though PCManFM-QT is installed now, Emacs and dired are still the primary file manager. Mostly, this week, I configured the QT applications to use Kvantum with a Dracula theme and fixed GTK4 applications to also use a Dracula theme. I also am almost done with my QTile config. I still need to find a emoji to use as an icon for the system section of the top bar, but I&rsquo;m almost there. I&rsquo;ll get a screen shot of it in action some time soon and the config will go up on my github once I have it converted to a literate program document. That&rsquo;ll be another little while though.
</p>

<p>
Anyway, that&rsquo;s it for updates for this week. Look forward to next week!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-02-11 Sun 23:11</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.7)</p>
</div>
</body>
</html>